# Operations

In [4]:
import numpy as np 
import pandas as pd

## Dataframes Basic operation

In [5]:

df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [6]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [7]:
df1.shape

(5, 3)

In [8]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [9]:
df1.info

<bound method DataFrame.info of    A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500>

In [10]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [12]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [14]:
df1['A'] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

In [15]:
def square(x):
    return x**2

In [17]:
df1['B']= df1['B'].apply(square)

In [18]:
df1

   A     B    C
0  1   100  100
1  2   400  200
2  3   900  300
3  4  1600  400
4  5  2500  500

In [19]:
df1['D']= df1['B'].apply(square)

In [20]:
df1

   A     B    C        D
0  1   100  100    10000
1  2   400  200   160000
2  3   900  300   810000
3  4  1600  400  2560000
4  5  2500  500  6250000

In [22]:
df1['D'] = df1["B"].apply(lambda x : x**2)

nunique() is a function (method) in Pandas.

ðŸ”¹ What it does:

It returns the number of unique (distinct) values in a Series (or column).

You can think of it as len(set(...)) but optimized for Pandas.

In [1]:
import pandas as pd

data = {
    'region': ['Eastern Europe', 'Eastern Europe', 'Western Europe', 'Eastern Europe'],
    'country': ['Poland', 'Ukraine', 'France', 'Poland']
}
df = pd.DataFrame(data)

In [2]:
df

           region  country
0  Eastern Europe   Poland
1  Eastern Europe  Ukraine
2  Western Europe   France
3  Eastern Europe   Poland

In [3]:
print(df[df['region'] == 'Eastern Europe']['country'].nunique())

2